import React from "react";

import styles from "./privacy.module.css";
import { CategoriesNavigation } from "../../components/CategoriesNav/CategoriesNavigation";
import { ContentWrapper } from "../../components/contentWrapper/ContentWrapper";
import { Header } from "../../components/Header/Header";
import { Footer } from "../../components/Footer/Footer";
import { CallbackBlock } from "../../components/CallbackForm/CallbackBlock";

export const Privacy = () => {
  window.scroll(0, 0);
  return (
    <>
      <Header />
      <CategoriesNavigation />
      <ContentWrapper className={styles.wrapper}>
        <h1>Політика конфіденційності</h1>
        <article className={styles.privacy}>
          <h5>1. ВИЗНАЧЕННЯ ТЕРМІНІВ</h5>
          <p>
            <b> 1.1</b> У цій Політиці конфіденційності
            використовуються такі терміни:
          </p>
          <p>
            <b> 1.1.1. </b> Адміністрація сайту
            Інтернет-магазину (далі – Адміністрація сайту) »
            – уповноважені співробітники управління сайтом,
            діючі від імені інтернет-магазину Grib, які
            організовують і здійснює обробку персональних
            даних, а також визначає мету обробки
            персональних даних, склад персональних даних,
            які підлягають обробці, дії або операції, що
            здійснюються з персональними даними.
          </p>
          <p>
            <b> 1.1.2.</b> «Персональні дані» - будь-яка
            інформація, що відноситься до прямо або побічно
            визначеним або визначається фізичній особі
            (суб'єкту персональних даних).
          </p>
          <p>
            <b> 1.1.3.</b> «Обробка персональних даних -
            будь-яка дія (операція) або сукупність дій
            (операцій), які здійснюються з використанням
            засобів автоматизації або без використання таких
            засобів із персональними даними, включаючи збір,
            запис, систематизацію, накопичення, зберігання,
            уточнення (оновлення, зміну), використання,
            передача (поширення, надання, доступ),
            знеособлення, блокування, видалення, знищення
            персональних даних.
          </p>
          <p>
            <b>1.1.4.</b>
            «Конфіденційність персональних даних» -
            обов'язкове для дотримання Адміністратором або
            іншим отримали доступ до персональних даних
            особою вимога не допускати їх поширення без
            згоди суб'єкта персональних даних або наявності
            іншого законного підстави.
          </p>
          <p>
            <b>1.1.5.</b> «Користувач сайту
            Інтернет-магазину Grib» – особа, яка має доступ
            до Сайту, за допомогою мережі Інтернет і
            використовує Сайт інтернет-магазину.
          </p>
          <p>
            <b>1.1.6.</b> «Cookies» — невеликий фрагмент
            даних, відправлений веб-сервером і зберігається
            на комп'ютері користувача, який веб-клієнт або
            веб-браузер кожен раз пересилає веб-сервера в
            HTTP-запиті при спробі відкрити сторінку
            відповідного сайту.
          </p>
          <p>
            <b>1.1.7.</b> «IP-адреса» — унікальний мережевий
            адреса вузла в комп'ютерній мережі, побудованої
            за протоколом IP.
          </p>
          <h5>2. ЗАГАЛЬНІ ПОЛОЖЕННЯ</h5>
          <p>
            <b>2.1.</b> Використання Користувачем сайту
            Інтернет-магазину означає згоду з цією Політикою
            конфіденційності та умовами обробки персональних
            даних Користувача.
          </p>
          <p>
            <b>2.2.</b> У разі незгоди з умовами Політики
            конфіденційності Користувач повинен припинити
            використання сайту Інтернет-магазину.
          </p>
          <p>
            <b>2.3.</b> Ця Політика конфіденційності
            застосовується лише до сайту Інтернет-магазину
            Grib. Інтернет-магазин не контролює і не несе
            відповідальності за сайти третіх осіб, на які
            Користувач може перейти за посиланнями,
            доступним на сайті Інтернет-магазину.
          </p>
          <p>
            <b>2.4.</b> Адміністрація сайту не перевіряє
            достовірність персональних даних, що надаються
            Користувачем сайту Інтернет-магазину.
          </p>
          <h5>3. ПРЕДМЕТ ПОЛІТИКИ КОНФІДЕНЦІЙНОСТІ</h5>
          <p>
            <b>3.1.</b> Ця Політика конфіденційності
            встановлює зобов'язання Адміністрації сайту
            інтернет-магазину щодо нерозголошення і
            забезпечення режиму захисту конфіденційності
            персональних даних, які Користувач надає за
            запитом Адміністрації сайту при реєстрації на
            сайті інтернет-магазину або при оформленні
            замовлення для придбання Товару.
          </p>
          <p>
            <b>3.2.</b> Персональні дані, дозволені до
            обробки в рамках цієї Політики конфіденційності,
            надаються Користувачем шляхом заповнення форми
            при оформленні замовлення на Сайті
            інтернет-магазину Grib і включають в себе
            наступну інформацію
          </p>
          <p>
            <b>3.2.1.</b> ПІБ Користувача;
          </p>
          <p>
            <b>3.2.2.</b> контактний телефон;
          </p>
          <p>
            <b>3.2.3.</b> адреса електронної пошти (e-mail);
          </p>
          <p>
            <b>3.2.4.</b> адреса доставки Товару;
          </p>
          <p>
            <b>3.2.5.</b> місце проживання Користувача.
          </p>
          <h5>
            4. МЕТУ ЗБОРУ ПЕРСОНАЛЬНОЇ ІНФОРМАЦІЇ
            КОРИСТУВАЧА
          </h5>
          <p>
            <b>4.1.</b> Персональні дані Користувача
            Адміністрація сайту інтернет-магазину може
            використовувати в цілях:
          </p>
          <p>
            <b>4.1.1.</b> Ідентифікації Користувача,
            зареєстрованого на сайті Інтернет-магазину, для
            оформлення замовлення і (або) укладення Договору
            купівлі-продажу товару дистанційним способом з
            Інтернет-магазином Grib.
          </p>
          <p>
            <b>4.1.2.</b> Надання Користувачу доступу до
            персоналізованих ресурсів Сайту
            інтернет-магазину.
          </p>
          <p>
            <b>4.1.3.</b> Встановлення зворотного зв'язку з
            Користувачем, включаючи направлення повідомлень,
            запитів, що стосуються використання Сайту
            інтернет-магазину, надання послуг, обробка
            запитів і заявок від Користувача.
          </p>
          <p>
            <b>4.1.4.</b> Визначення місця знаходження
            Користувача для забезпечення безпеки,
            запобігання шахрайства.
          </p>
          <p>
            <b>4.1.5.</b> Підтвердження достовірності та
            повноти персональних даних, наданих
            Користувачем.
          </p>
          <p>
            <b>4.1.6.</b> Створення облікового запису для
            здійснення покупок, якщо Користувач дав згоду на
            створення облікового запису.
          </p>
          <p>
            <b>4.1.7.</b> Повідомлення Користувача Сайту
            інтернет-магазину про стан Замовлення.
          </p>
          <p>
            <b>4.1.8.</b> Обробки та отримання платежів,
            підтвердження податку або податкових пільг
            Користувачем.
          </p>
          <p>
            <b>4.1.9.</b> Надання Користувачеві ефективної
            клієнтської та технічної підтримки при
            виникненні проблем, пов'язаних з використанням
            Сайту інтернет-магазину.
          </p>
          <p>
            <b>4.1.10.</b> Надання Користувачеві з його
            згоди, оновлення продукції, спеціальних
            пропозицій, інформації про ціни, новинний
            розсилки та інших відомостей від імені
            Інтернет-магазину або від імені партнерів
            Інтернет-магазину.
          </p>
          <p>
            <b>4.1.11.</b> Здійснення рекламної діяльності з
            згоди Користувача.
          </p>
          <p>
            <b>4.1.12.</b> Надання користувачам доступу на
            сайти або сервіси партнерів Інтернет-магазину з
            метою отримання продуктів, оновлення і послуг.
          </p>
          <h5>
            5. СПОСОБИ І ТЕРМІНИ ОБРОБКИ ПЕРСОНАЛЬНОЇ
            ІНФОРМАЦІЇ
          </h5>
          <p>
            <b>5.1.</b> Обробка персональних даних
            Користувача здійснюється без обмеження терміну,
            будь-яким законним способом, в тому числі в
            інформаційних системах персональних даних з
            використанням засобів автоматизації або без
            використання таких коштів.
          </p>
          <p>
            <b>5.2.</b> Користувач погоджується з тим, що
            Адміністрація сайту має право передавати
            персональні дані третім особам, зокрема,
            кур'єрським службам, організаціями поштового
            зв'язку, операторам електрозв'язку, виключно в
            цілях виконання замовлення Користувача,
            оформленого на Сайті інтернет-магазину «Geek
            House», включаючи доставку Товару.
          </p>
          <p>
            <b>5.3.</b> Персональні дані Користувача можуть
            бути передані уповноваженим органам державної
            влади України тільки на підставах і в порядку,
            встановленими законодавством України.
          </p>
          <p>
            <b>5.4.</b> При втраті чи розголошенні
            персональних даних Адміністрація сайту інформує
            Користувача про втрату або розголошення
            персональних даних.
          </p>
          <p>
            <b>5.5</b>. Адміністрація сайту приймає
            необхідні організаційні та технічні заходи для
            захисту персональної інформації Користувача від
            неправомірного або випадкового доступу,
            знищення, зміни, блокування, копіювання,
            розповсюдження, а також інших неправомірних дій
            третіх осіб.
          </p>
          <p>
            <b>5.6.</b> Адміністрація сайту спільно з
            Користувачем приймає всі необхідні заходи по
            запобіганню збитків або інших негативних
            наслідків, викликаних втратою або розголошенням
            персональних даних Користувача.
          </p>
          <h5>6. ЗОБОВ'ЯЗАННЯ СТОРІН</h5>
          <p>
            <b>6.1.</b> Користувач зобов'язаний:
          </p>
          <p>
            <b>6.1.1.</b> Надати інформацію про персональних
            даних, необхідну для користування сайтом
            інтернет-магазину інтернет-магазин Philips Hue в
            Україні - Grib.
          </p>
          <p>
            <b>6.1.2.</b> Поновити, доповнити надану
            інформацію про персональних даних у разі зміни
            даної інформації.
          </p>
          <p>
            <b>6.2.</b> Адміністрація сайту зобов'язана:
          </p>
          <p>
            <b>6.2.1.</b> Використовувати отриману
            інформацію виключно для цілей, зазначених у п. 4
            цієї Політики конфіденційності.
          </p>
          <p>
            <b>6.2.2.</b> Забезпечити зберігання
            конфіденційної інформації в таємниці, не
            розголошувати без попереднього письмового
            дозволу Користувача, а також не здійснювати
            продаж, обмін, опублікування або розголошення
            іншими можливими способами переданих
            персональних даних Користувача, за винятком п.
            п. 5.2. і 5.3. цієї Політики Конфіденційності.
          </p>
          <p>
            <b>6.2.3.</b> Приймати заходи для захисту
            конфіденційності персональних даних Користувача
            згідно з порядком, звичайно використовуваного
            для захисту такого роду інформації в існуючому
            діловому обороті.
          </p>
          <p>
            <b>6.2.4.</b> Здійснити блокування персональних
            даних, які належать до відповідного
            Користувачеві, з моменту звернення або запиту
            Користувача або його законного представника або
            уповноваженого органу із захисту прав суб'єктів
            персональних даних на період перевірки, у разі
            виявлення недостовірних персональних даних або
            неправомірних дій.
          </p>
          <h5>7. ВІДПОВІДАЛЬНІСТЬ СТОРІН</h5>
          <p>
            <b>7.1.</b> Адміністрація сайту не виконала свої
            зобов'язання, несе відповідальність за збитки,
            завдані Користувачем у зв'язку з неправомірним
            використанням персональних даних, відповідно до
            законодавства України, за винятком випадків,
            передбачених п. п. 5.2., 5.3. і 7.2. цієї
            Політики Конфіденційності.
          </p>
          <p>
            <b>7.2.</b> У разі втрати або розголошення
            Конфіденційної інформації Адміністрація сайту не
            несе відповідальність, якщо ця конфіденційна
            інформація:
          </p>
          <p>
            <b>7.2.1.</b> Стала публічним надбанням до її
            втрати або розголошення.
          </p>
          <p>
            <b>7.2.2.</b> Була отримана від третьої сторони
            до моменту її отримання Адміністрацією сайту.
          </p>
          <p>
            <b>7.2.3.</b> Була розголошена з згоди
            Користувача.
          </p>
          <h5>8. ВИРІШЕННЯ СПОРІВ</h5>
          <p>
            <b>8.1.</b> До звернення в суд з позовом у
            спорах, що виникають з відносин між Користувачем
            сайту Інтернет-магазину і Адміністрацією сайту,
            обов'язковим є пред'явлення претензії (письмової
            пропозиції про добровільне врегулювання спору).
          </p>
          <p>
            <b>8.2.</b> Одержувач претензії протягом 30
            календарних днів з дня отримання претензії,
            письмово повідомляє заявника претензії про
            результати розгляду претензії.
          </p>
          <p>
            <b>8.3.</b> При не досягненні угоди спір буде
            переданий на розгляд в судовий орган у
            відповідності з чинним законодавством України.
          </p>
          <p>
            <b>8.4.</b> До цієї Політики конфіденційності і
            відносин між Користувачем і Адміністрацією сайту
            застосовується чинне законодавство України.
          </p>
          <h5>9. ДОДАТКОВІ УМОВИ</h5>
          <p>
            <b>9.1.</b> Адміністрація сайту має право
            вносити зміни в дану Політику конфіденційності
            без згоди Користувача.
          </p>
          <p>
            <b>9.2.</b> Нова Політика конфіденційності
            набирає чинності з моменту її розміщення на
            Сайті інтернет-магазину, якщо інше не
            передбачено новою редакцією Політики
            конфіденційності.
          </p>
          <p>
            <b>9.3.</b> Усі пропозиції або питання по цій
            Політиці конфіденційності слід повідомляти за
            вказаними даними в розділі "КОНТАКТИ".
          </p>
        </article>
      </ContentWrapper>
      <CallbackBlock />
      <Footer />
    </>
  );
};
